Repository: fr0staman/fr0staman_bot
Catalog: locales/*/LC_MESSAGES/fr0staman_bot.po
Languages: ru, uk

source: Thank you! You receive +100 kg forever 🎂
ru: Спасибо! Вы получаете +100 кг навсегда 🎂
uk: Дякуємо! Ви отримуєте +100 кг назавжди 🎂

source: 😭 There is no pig in your barn!
ru: 😭 В вашем хлеву нет хряков!😭
uk: 😭 В вашому хліву немає хряків!

source: 🐽 First of all - subscribe to the channel!
ru: 🐽 Сначала подпишитесь на канал!
uk: 🐽 Спочатку підпишіться на канал!

source: Thank you! You receive +500kg today 🎂
ru: Спасибо! Вы получаете +500 кг на сегодня 🎂
uk: Дякуємо! Ви отримуєте +500 кг на сьогодні 🎂

source: <b>Thank you!</b> Your gift :)
ru: <b>Спасибо!</b> Ваш подарок :)
uk: <b>Дякуємо!</b> Ваш подарунок :)

source: Hello! This bot does nothing useful. I'm serious. List of commands: - /help Questions, suggestions - @fr0staman. I will be glad :) News - @fr0staman_channel
ru: Здравствуйте! Я — развлекательный бот, который содержит в себе игру "Вырасти хряка", и солянку со странными функциями. Это очень серьезно. Начать игру — /grow Список команд — /help Новости - @fr0staman_channel
uk: Вітаю вас! Я — розважальний бот, який містить гру "Вирости пацєтко", та купу дивних функцій. Почати гру — /grow Список команд — /help Новини - @fr0staman_channel

source: <b>Important!</b> Who subscribed on <a href="https://t.me/fr0staman_channel">channel</a> - receives +500 kg to his hang pig <b>forever</b>!
ru: Вы подписаны на <a href="https://t.me/fr0staman_channel">наш канал</a>! Вам положено<b>+100</b> кг <b>навсегда</b>!
uk: Ви підписані на <a href="https://t.me/fr0staman_channel">канал</a>! Ви отримуєте <b>+100</b> кг <b>назавжди</b>

source: Hru, {mention}! Welcome to the {chat_title}! Start chat game — /grow Help for the bot — /help Bot news — @fr0staman_channel
ru: Хрю, {mention}! Добро пожаловать в {chat_title}! Я — бот, который содержит в себе игру "Вырасти хряка", и всякое-всякое. Взять участие в игре — /grow Возможности бота — /help Новости — @fr0staman_channel
uk: Хрю, {mention}! Ласкаво просимо в {chat_title}! Я — бот, який містить в собі гру "Вирости хряка", та всяку всячину. Взяти участь в грі — /grow Допомога по боту — /help Новини — @fr0staman_channel

source: Why are you doing this... {chat_title} lost {mention}.
ru: Ну почему вы так :( {chat_title} потерял {mention}.
uk: Ну чому ви так :( {chat_title} втратив {mention}.

source: Co-co-co, fucking cock voice chat, co-co-co!
ru: Вот же войсобляди, собрали свой курятник!
uk: Адисі, зібрався курник войсоблядей!

source: Does not have information.
ru: Нет информации.
uk: Немає інформації.

source: Greetings disabled successfully!
ru: Приветствие успешно включено!
uk: Привітання вимкнено успішно!

source: Greetings enabled successfully!
ru: Приветствие успешно выключено!
uk: Привітання ввімкнено успішно!

source: This option exist, but give me a correct parameter!
ru: Эта опция существует, но введите правильный параметр!
uk: Ця опція існує, але дайте мені коректний аргумент!

source: Successfully changed! Now, visible pigs in the top starts with {setting} kg.
ru: Успешно изменено! Теперь, в топе, будут видны хряки только с массой больше {setting} кг.
uk: Успішно змінено! Тепер, в топі будуть виднітись свині, маса яких починається з {setting} кг.

source: You entered incorrect parameter. Only a number.
ru: Вы ввели некорректный аргумент Можно ввести только номер.
uk: Ви ввели некорректний аргумент. Можна ввести тільки номер.

source: That function not exist.
ru: Такая функция не существует...
uk: Така функція не існує...

source: EPYC. Just EPYC.
ru: Эпик. Просто Эпик.
uk: Епік. Просто Епік. Хрюкни.

source: I am Valera turururu, I am Valera turururu, I am Valera turururu And you're not a admin.
ru: Я Валера туруруру, Я Валера туруруру, Я Валера туруруру, А ты не админ.
uk: Я Валєра туруру, Я Валєра туруру, Я Валєра туруру, А ти не адмін.

source: techincal chocolaps
ru: технические шоколапки
uk: технічні шоколапки

source: You are subscribed on <a href="https://t.me/fr0staman_channel">channel</a>!You are supposed to <b>+100</b> kg <b>forever</b>.
ru: Вы подписаны на <a href="https://t.me/fr0staman_channel">наш канал</a>! Вам положено<b>+100</b> кг <b>навсегда</b>.
uk: Ви підписані на <a href="https://t.me/fr0staman_channel">канал</a>! Ви отримуєте <b>+100</b> кг <b>назавжди</b>.

source: Subscribe on <a href="https://t.me/fr0staman_channel">channel</a>! Do not waste opportunity to get <b>+100</b> kg forever.
ru: Подпишитесь на <a href="https://t.me/fr0staman_channel">наш канал</a>! Не теряйте возможность получить <b>+100</b> кг навсегда.
uk: Підпишіться на <a href="https://t.me/fr0staman_channel">наш канал</a>! Не втрачайте можливість отримати <b>+100</b> кг назавжди.

source: Help for the bot: https://telegra.ph/Pomoshch--fr0staman-bot-09-30
ru: Помощь по боту: https://telegra.ph/Pomoshch--fr0staman-bot-09-30
uk: Допомога по боту: https://telegra.ph/Pomoshch--fr0staman-bot-09-30

source: Your name: {first_name}
ru: Ваше имя: {first_name}
uk: Твоє ім'я: {first_name}

source: your beauty
ru: твоя красотка
uk: твоя красуня

source: Give me a user_id as a argument :)
ru: Дай мне ID пользователя как аргумент :)
uk: Дай мені id користувача як аргумент :)

source: Pooping sobaka, crawling gusaka <b>{user}</b>
ru: Срал пёс, пердел гусь <b>{user}</b>
uk: Срав пес, пердів гусака <b>{user}</b>

source: gained
ru: поправился
uk: набрав

source: lost
ru: похудел
uk: схуд

source: Welcome to the game, {mention}! Keep using /grow command, to grow your own pig :)
ru: Добро пожаловать в игру, {mention}! Дальше используй команду /grow, чтобы выращивать своего хряка :)
uk: Ласкаво просимо в гру, {mention}! І надалі використовуй команду /grow, щоб вирощувати свого хряка :)

source: unnamed pig
ru: безымянный хряк
uk: безіменний хрюндель

source: {mention}, your {name} {action} on {value} kg fat! Weight of your pig: {current} kg.
ru: {mention}, ваш 🐽 {name} {action} на {value} кг сала! Масса вашего хряка: {current} кг.
uk: {mention}, ваш 🐽 {name} {action} на {value} кг сальця! Маса вашого кнура: {current} кг.

source: {minutes} minute
ru: {minutes} минуту
uk: {minutes} хвилину

source: Next feeding in {to_minutes}.
ru: Следующая кормёжка через {to_minutes}.
uk: Наступна годівля через {to_minutes}.

source: {hours} hour
ru: {hours} час
uk: {hours} годину

source: Next feeding in {to_hours} and {to_minutes}.
ru: Следующая кормёжка через {to_hours} {to_minutes}.
uk: Наступна годівля через {to_hours} {to_minutes}.

source: You already fed pig today! {next_feed}
ru: Вы сегодня уже кормили своего хряка! {next_feed}
uk: Ви сьогодні вже годували своє поросятко! {next_feed}

source: The tag does not fit more than 64 letters!
ru: На бирку не помещается больше 64 символов!
uk: На бірку не влазить більше 64 символів!

source: New name of your 🐷: {new_name}
ru: Новое имя вашего 🐷: {new_name}
uk: Нове ім'я вашого 🐷: {new_name}

source: Your chat pig doesnt have a name! To name your pig, just call /name pig_name, anything :)
ru: Ваш чатовый хряк не имеет имени! Чтобы назвать вашего хрюка, используйте /name ваше_имя, и готово :)
uk: Ваш хрюндель не має імені! Щоб його назвати, застосуйте /name ваше_ім'я, і готово :)

source: Name of your pig: {name} Change name - /name pig_name.
ru: Имя вашей свиньи: {name} Изменить имя — /name ваше_имя.
uk: Ім'я вашої свині: {name} Змінити ім'я - /name ваше_ім'я.

source: Your 🐷 {name} Has weight {current}
ru: Ваш 🐷 {name} Имеет массу {current} кг
uk: Ваш 🐷 {name} Має масу {current} кг

source: 🐷 Top 50 schweinehryaks 🐷
ru: 🐷 Топ-50 швайнокарасей 🐷
uk: 🐷 Топ-50 швайнобряхерів 🐷

source: 🐷 Top 10 pig beasts 🐷
ru: 🐷 Топ 10 мегахряков 🐷
uk: 🐷 Топ-10 хрючних термінаторів🐷

source: Game "Grow The Pig" - only for chats!
ru: Игра "Вырасти хряка" только для чатов!
uk: Гра "Вирости хряка" - тільки для чатів!

source: Your chat pig has no name! To name your pig, then /name his_name, just for fun :)
ru: Ваш чатовый хряк не имеет имени! Чтобы назвать вашу хрюку, используйте /name ваше_имя, и готово :)
uk: Ваш хрюндель не має імені! Щоб його назвати, застосуйте /name ваше_ім'я, і готово :)

source: Game "Grow The Pig" Commands: /grow - once a day feed your pig /name - name your piggy /my - weigh and listen /top - top of the fattest pigs in your barn
ru: Игра "Вырасти хряка" Команды: /grow — накормить хряка (раз в день) /name — имя хряка /my — взвесить и послушать /top — топ самых лютых хряков
uk: Гра "Вирости хряка" Команди: /grow — нагодувати свого нахрюка (один раз в день!) /name — назва свого пацєтка /my — зважити та почухати /top — топ найбільш салистів драконів

source: 😭 There is no chat pig in your barn!
ru: 😭 В вашем хлеву нет хряков!
uk: 😭 В вашому чатовому хліву немає хряків!

source: Deploying schweinelocators...
ru: Разворачивание швайнолокаторов...
uk: Розгортання свинолокаторів...

source: Hoof marks founded...
ru: Следы свинячьих копытец найдены...
uk: Знайдені сліди свинячих копитець...

source: SCHWEINELOCATORS INSANELY SCREAMING!!
ru: СВИНОЛОКАТОРЫ ЗАШКАЛИВАЮТ!
uk: СВИНОЛОКАТОРИ ЗАШКАЛЮЮТЬ!!!

source: 🐷 <b>ATTENTION!</b> 🐷 <b>Pig of the day</b> is announced {mention}!
ru: 🐷 <b>ВНИМАНИЕ!</b> 🐷 <b>Швайнокарасём дня</b> оказывается {mention}!
uk: 🐷 <b>УВАГА!</b> 🐷 <b>Хряком дня</b> оголошується {mention}!

source: Position of the schweinelocators told us - <b>pig of the day</b> is {name}!
ru: Отчёт свинолокаторов показывает - <b>швайнокарасём дня</b> является {name}!
uk: Звіт свинолокаторів кажуть про те, що <b>хряком дня</b> є {name}!

source: ✨ Name changed successfully!
ru: ✨ Имя изменено успешно!
uk: ✨ Ім'я змінено успішно!

source: 🐷 Your pig is now called: {new_name}
ru: 🐷 Ваша свинья теперь называется: {new_name}
uk: 🐷 Ваша свиня тепер називається: {new_name}

source: 🤕 This button is not for you!
ru: 🤕 Эта кнопка не для вас!
uk: 🤕 Ця кнопка не для вас!

source: 😎 You are in the rating of your chat!
ru: 😎 Вы попали в рейтинг своего чата!
uk: 😎 Ви попали в рейтинг свого чату!

source: 🎊 Winner is {winner_name}! 🎊 He receives {diff} kg, but {looser_name} - loses fat, and its all... Current weight {winner_name} — {winner_weight}! Current weight {looser_name} — {looser_weight}... Arena for a best: @fr0staman_chat
ru: 🎊 Победителем становится {winner_name}! 🎊 Он получает {diff} кг, но {looser_name} - теряет сало, и всё... Текущая масса {winner_name} — {winner_weight} кг! Текущая масса {looser_name} — {looser_weight} кг... Хохлоарена для самых жирных: @fr0staman_chat
uk: 🎊 Переможцем є {winner_name}! 🎊 Він отримує {diff} кг, але {looser_name} - втрачає жир, та й ой... Теперішня маса {winner_name} — {winner_weight} кг! Теперішня маса {looser_name} — {looser_weight} кг... Арена для найкращих: @fr0staman_chat

source: 🎉 Victory for {winner_name}! 🎉 He adds to himself mass {diff} kg, but {looser_name} minus... Current weight {winner_name} — {winner_weight}! Current weight {looser_name} — {looser_weight}... Run to the @fr0staman_chat
ru: 🎉 Победа за {winner_name}! 🎉 Он прибавляет к себе {diff} кг, но {looser_name} минусует... Текущая масса {winner_name} — {winner_weight} кг! Текущая масса {looser_name} — {looser_weight} кг... Побежали в @fr0staman_chat
uk: 🎉 Перемога для {winner_name}! 🎉 Він додає до своєї маси {diff} кг, але {looser_name} мінусує... Теперішня маса {winner_name} — {winner_weight} кг! Теперішня маса {looser_name} — {looser_weight} кг... Обидва побігли в @fr0staman_chat

source: 🍖 <b><i>CRITICAL DAMAGE!</i></b> 🍖 {winner_name} melts +{diff} kg of fat, but {looser_name} - fuse it on @fr0staman_chat Current weight {winner_name} — {winner_weight}! Current weight {looser_name} — {looser_weight}...
ru: 🍖 <b><i>КРИТИЧЕСКИЙ УРОН!</i></b> 🍖 {winner_name} приплавляет +{diff} кг сала, а {looser_name} - ним же истекает в @fr0staman_chat Текущая масса {winner_name} — {winner_weight} кг! Текущая масса {looser_name} — {looser_weight} кг...
uk: 🍖 <b><i>КРИТИЧНА ШКОДА!</i></b> 🍖 {winner_name} доплавляє +{diff} кг жиру, але {looser_name} - сплавляється в @fr0staman_chat Теперішня маса {winner_name} — {winner_weight} кг! Теперішня маса {looser_name} — {looser_weight} кг...

source: ⚡ <b><i>CRITICAL DAMAGE! УРОН!</i></b> ⚡ {winner_name} eats to him mass +{diff} kg, but {looser_name}... So pity. Current weight {winner_name} — {winner_weight}! Current weight {looser_name} — {looser_weight}... Go to @fr0staman_chat!
ru: ⚡ <b><i>КРИТИЧЕСКИЙ УРОН!</i></b> ⚡ {winner_name} отжирает себе +{diff} кг, но{looser_name}... Жалкое зрелище. Текущая масса {winner_name} — {winner_weight} кг! Текущая масса {looser_name} — {looser_weight} кг... Хохлоарена: @fr0staman_chat!
uk: ⚡ <b><i>КРИТИЧНА ШКОДА!</i></b> ⚡ {winner_name} віджирає собі масу +{diff} кг, але {looser_name}... Як шкода. Теперішня маса {winner_name} — {winner_weight} кг! Теперішня маса {looser_name} — {looser_weight} кг... Ходімо в @fr0staman_chat!

source: 🔥 <b><i>KNOCKOUT!</i></b> 🔥 {winner_name} knocking and gets +{diff} kg! {looser_name} looses his meat. Current weight {winner_name} — {winner_weight}! Current weight {looser_name} — {looser_weight}... Arena for the best: @fr0staman_chat
ru: 🔥 <b><i>НОКАУТ!</i></b> 🔥 {winner_name} нокаутирует и получает +{diff} кг! {looser_name} теряет своё мясо. Текущая масса {winner_name} — {winner_weight} кг! Текущая масса {looser_name} — {looser_weight} кг... Арена для лучших: @fr0staman_chat
uk: 🔥 <b><i>НОКАУТ!</i></b> 🔥 {winner_name} нокаутує і віджирає +{diff} кг! {looser_name} стікає салом. Теперішня маса {winner_name} — {winner_weight} кг! Теперішня маса {looser_name} — {looser_weight} кг... Arena for the best: @fr0staman_chat

source: 🥩 <b><i>KNOCKOUT!</i></b> 🥩 {winner_name} knocking and receives +{diff} kg! {looser_name} looses his meat. Current weight {winner_name} — {winner_weight}! Current weight {looser_name} — {looser_weight}... Arena for the best: @fr0staman_chat
ru: 🥩 <b><i>НОКАУТ!</i></b> 🥩 {winner_name} нокаутирует и отжирает +{diff} кг! {looser_name} разваливается. Текущая масса {winner_name} — {winner_weight} кг! Текущая масса {looser_name} — {looser_weight} кг... Арена для лучших: @fr0staman_chat
uk: 🥩 <b><i>НОКАУТ!</i></b> 🥩 {winner_name} нокаутує на отримує +{diff} кг! {looser_name} втрачає своє мясо. Теперішня маса {winner_name} — {winner_weight} кг! Теперішня маса {looser_name} — {looser_weight} кг... Арена для найкращих: @fr0staman_chat

source: 🍽 <b>DRAW!</b> 🍽 Because piggies {draw1_name} and {draw2_name} fought veeery worthy, then both get {diff} kg.
ru: 🍽 <b>НИЧЬЯ!</b> 🍽 Поскольку боевые нахрюки {draw1_name} и {draw2_name} дрались ооочень достойно, то они обое получают {diff} кг. Молодцы.
uk: 🍽 <b>НІЧИЯ!</b> 🍽 Оскільки бойові нахрюки {draw1_name} та {draw2_name} бились дуууже постойно, то вони обоє отримують по {diff} кг.

source: Not enough battles...
ru: Недостаточно битв...
uk: Недостатньо битв...

source: Weight of your piggy {weight} kg {emoji}
ru: Масса вашего хряка {weight} кг {emoji}
uk: Маса вашого хряка {weight} кг {emoji}

source: This user supported bot developing. Thanks!
ru: Этот пользователь поддержал разработку бота. Спасибо!
uk: Цей користувач підтримав розробку бота. Дякуємо!

source: ⚔ Duel of boars ⚔
ru: ⚔ Дуэль хряков ⚔
uk: ⚔ Дуель хряків ⚔

source: @fr0staman_chat for fattest
ru: @fr0staman_chat для самых салистых
uk: @fr0staman_chat для найжирніших

source: 🛡 Boar {name} challenge to a duel! 🛡 Win percentage: {winrate} Preliminary weighing: {weight} kg
ru: 🛡 Хряк {name} вызывает на дуэль! 🛡 Процент побед: {winrate} Предварительное взвешивание: {weight} кг
uk: 🛡 Хряк {name} викликає на дуель! 🛡 Відсоток перемог: {winrate} Підготовчий замір: {weight} кг

source: Best of the best!
ru: Лучшие из лучших!
uk: Найкращі з найкращих!

source: 🐖 find out your pig mass
ru: 🐖 узнай массу своего хрюнделя 🐖
uk: 🐖 дізнайся масу свого хрюнделя 🐖

source: Weight: {weight} kg
ru: Масса: {weight} кг
uk: Маса: {weight} кг

source: Error!
ru: Ошибка!
uk: Помилка!

source: This bug has already been reported.
ru: Об этой ошибке уже уведомлены.
uk: Про цей баг вже повідомили розробника.

source: An error has occurred :( Bug report has already been sent!
ru: Случилась ошибка! :( Багрепорт уже отправлен разработчику!
uk: Сталася помилка :( Баг репорт щойно відправлено!

source: 💥 find out overclocking of your processor 💥
ru: 💥 узнай разгон своего процессора 💥
uk: 💥 дізнайся розгін свого процесора 💥

source: Overclocking of your processor {cpu_clock} GHz {cpu_emoji}
ru: Разгон вашего процессора {cpu_clock} ГГц {cpu_emoji}
uk: Розгін вашого процесора {cpu_clock} ГГц {cpu_emoji}

source: 🐏 find out overclocking of your RAM 🐏
ru: 🐏 узнай разгон своей ОЗУ 🐏
uk: 🐏 дізнайся розгін своєї ОЗУ 🐏

source: Overclocking of your RAM {ram_clock} Mhz {ram_emoji}
ru: Разгон вашей ОЗУ {ram_clock} МГц {ram_emoji}
uk: Розгін вашої ОЗУ {ram_clock} МГц {ram_emoji}

source: 🎢 find out hashrate of your GPU 🎢
ru: 🎢 узнай хэшрейт своей видеокарты 🎢
uk: 🎢 дізнайся хешрейт своєї відеокарти 🎢

source: Hashrate of your videocard {gpu_hashrate} MH/s {gpu_emoji}
ru: Хэшрейт вашей видеокарты {gpu_hashrate} МХ/с {gpu_emoji}
uk: Хешрейт вашої відеокарти {gpu_hashrate} МХ/с {gpu_emoji}

source: Keep going!
ru: Продолжайте!
uk: Продовжуйте!

source: Press space and type future name of your boar!
ru: Нажмите пробел и набирайте новое имя вашего хряка!
uk: Нажміть пробіл, та набирайте нове ім'я свого хряка!

source: Name of your boar: {name} If you want change name of your pig, just type: @fr0staman_bot name *pig_name*
ru: Имя вашего нахрюка: {name} Если вы хотите изменить имя вашего хряка, просто наберите: @fr0staman_bot имя *новое_имя*
uk: Ім'я вашого нахрюка: {name} Щоб змінити ім'я вашого кнура, просто наберіть: @fr0staman_bot ім'я *нове_ім'я*

source: click to set a name
ru: тицьніть, щоб назвати
uk: нажміть, щоб виставити ім'я

source: Todays name of your pig: {past_name} Future name of your boar: {future_name} Just click the button!
ru: Имя вашего хрюнделя: {past_name} Новое имя вашего хряка: {future_name} Просто нажмите на кнопку!
uk: Сьогоднішнє ім'я вашої свині: {past_name} Майбутнє ім'я вашого порося: {future_name} Просто тицьніть на кнопку!

source: Pig of the day!
ru: 🕌 Свинья дня!
uk: Хряк дня!

source: who is the hryak of your chat?
ru: кем является нахрюк вашего чата?
uk: хто є поросям вашого чату?

source: Click the button to catch the hryak of your chat...
ru: Нажмите на кнопку, чтобы поймать швайнокарася вашего чата...
uk: Натисніть на кнопку, щоб спіймати свиню вашого чату...

source: hruk of the death №{number}
ru: хрюк смерти №{number}
uk: хрюк смерті №{number}

source: tikay s sela - it's not your button
ru: тикай з села — это не твоя кнопка
uk: тікай з села - ця кнопка не для тебе

source: Thank you! I will be sure to let you, when your brilliant grunt will be accepted!
ru: Спасибо! Я обязательно сообщу, когда ваш прелестный хрюк будет принят!
uk: Дякую! Я обов'язково повідомлю, коли ваш прекрасний хрюк буде прийнято!

source: <b>Important!</b> Special thanks to you, for a destiny in life of this bot! Just take your gift :)
ru: <b>Важная информация!</b> Больше спасибо вам, за участие в жизни бота! Просто получите свой подарок :)
uk: <b>Важливо!</b> Дуже дякую за те, що ви берете участь в житті бота! Просто отримайте свій подарунок :)

source: Write your text as argument!
ru: Напишите свой текст как аргумент!
uk: Напишіть текст як аргумент!

source: you are pidor
ru: ты пидор
uk: ти підор

source: pidaras
ru: пидарас
uk: підарас
